In [1]:
import numpy as np          # type: ignore
import pandas as pd         # type: ignore

In [2]:
row   = ['one', 'two', 'three', 'four', 'five', 'six']      # if there is more Rows   . it will be error!!
col   = ['for', 'state', 'pop', 'debt']                     # if there is more columns. it will be NaN.
data1 = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'for' : [2000, 2001, 2002, 2001, 2002, 2003],
        'pop'  : [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

frame = pd.DataFrame(data1, columns=col ,index=row)
frame

        for   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [3]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame['debt'] = val
frame

        for   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [4]:
frame['debt'] = 16.5
frame

        for   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [5]:
frame['debt'] = np.arange(6.)
frame

        for   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [6]:
pop = { 'Nevada': {2001: 2.4, 2002: 2.9},
        'Ohio'  : {2000: 1.5, 2001: 1.7, 2002: 3.6}}

print(pd.DataFrame(pop, index=[2001, 2002, 2002]))
print("------")
print(pd.DataFrame(pop, index=[2001, 2002, 2019]))

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2002     2.9   3.6
------
      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2019     NaN   NaN

In [7]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
print(obj)
print("-------------------")
print(obj[obj<2])
print("-------------------")
obj["b":"c"]=5 
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64
-------------------
a    0.0
b    1.0
dtype: float64
-------------------

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

<h1 align="center"><strong>VIP compare</strong></h1>
<div style="background-color:rgb(255, 255, 255) ; color:rgb(46, 40, 40); width: 100%; height: 50px; text-align: center; font-weight: bold; line-height: 50px; margin: 10px 0; font-size: 24px;">
1️⃣ DF[col] & DF.col
</div>

In [8]:
data1 ={'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada','Nevada','Nevada'],
        'year' : [2000, 2001, 2002, 2001, 2002, 2003,2004,2005],
        'pop'  : [1.5, 1.7, 3.6, 2.4, 2.9, 3.2,4.3,2.5]}

frame1 = pd.DataFrame(data1)
frame1

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2
6  Nevada  2004  4.3
7  Nevada  2005  2.5

In [9]:
print(frame1["year"])
print("==============")
print(frame1.year)

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
6    2004
7    2005
Name: year, dtype: int64
==============
0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
6    2004
7    2005
Name: year, dtype: int64

## 🚀 The Difference Between Accessing Data in a DataFrame

| 🏷️ Syntax | ✅ Works For | ❌ Limitations |
|-----------|------------|---------------|
| `frame[col]` | Any column name | None, fully flexible |
| `frame.col`  | Only when the column name is a valid attribute | Cannot create a new column |

💡 **Tip:** Always use `frame[col]` for maximum flexibility and to avoid unexpected errors! 🔥

In [10]:
row = ['one', 'two', 'three', 'four', 'five', 'six']  # if there is more. it will be error!!
col = ['for', 'state', 'pop', 'debt']                 # if there is more. it will be NaN.
data1= {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'for'  : [2000, 2001, 2002, 2001, 2002, 2003],
        'pop'  : [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

frame = pd.DataFrame(data1, columns=col ,index=row)
print(frame["for"])
# print(frame.for)   # error

frame

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: for, dtype: int64

        for   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

## 🚨 Important Note: You **Cannot** Create New Columns with `frame.eastern` ❌  

Attempting to assign a new column using **dot notation** (`frame.eastern`) will cause an **error**! ❌  

```python
frame.eastern = (frame.state == 'Nevada')  
print(frame)  # ❌ Error
----------------------
frame["eastern"] = (frame["state"] == "Nevada")  
print(frame)  # ✅ Works fine

<h1 align="center"><strong></strong></h1>
<div style="background-color:rgb(255, 255, 255) ; color:rgb(46, 40, 40); width: 100%; height: 50px; text-align: center; font-weight: bold; line-height: 50px; margin: 10px 0; font-size: 24px;">
compare 2️⃣
</div>

💡 **Tip**:

* When slicing with labels (strings) → The last row is included ✅
* When slicing with integers → The last row is excluded ❌

In [11]:
arr = np.arange(5)
df  = pd.Series(arr,index=["a","b","c","d","e"])
print(df)

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [12]:
print(df["a":"c"])          
print("=============")
print(df[0:2])

a    0
b    1
c    2
dtype: int32
=============
a    0
b    1
dtype: int32

## 🎯 Slicing DataFrames: **String Indexing vs Integer Indexing**  

### 🔹 **Using String Indexing (`df["a":"c"]`)**  
✅ **Inclusive** → **The last label is included!**  
```python
print(df["a":"c"])  # ✅ Includes "c"
```
--- 
❌ **Exclusive** → **The last index is NOT included!**
```python
print(df[0:2])      # ❌ Does NOT include row 2